In [1]:
import pandas as pd
import yaml

# 1. Converting .yaml and .csv files to Pandas dataframes

In [2]:

with open('customer_demographics.yaml', 'r') as stream:
    data = yaml.safe_load(stream)


demo_df = pd.DataFrame(data.values())

ic| demo_df:                             address                 city credit_card_expires  \
             0         621 Chavez Ramp Suite 938      West Deniseport               06/31
             1                   592 Mccoy River      Port Dannymouth               11/24
             2               8923 Aaron Turnpike       Port Rhondaton               11/31
             3               496 Margaret Shoals         Smithborough               04/33
             4        0807 Logan Fords Suite 355        Contrerasside               10/25
             ...                             ...                  ...                 ...
             9995             419 Lopez Crossing  North Nicolechester               01/30
             9996            38594 Franklin Pine          Port Joshua               01/31
             9997  535 Kimberly Station Apt. 546           Garzaville               07/24
             9998            35316 Becky Terrace          Port Donald               04/24
             9999  6101 Thompson Ridges Apt. 896         Marissamouth               05/25

                    credit_card_number         credit_card_provider  \
             0        2269172571677458  Diners Club / Carte Blanche
             1            676320507830                 JCB 16 digit
             2     4607779976715144588                 JCB 16 digit
             3        4234465830748237                   Mastercard
             4           4985681645741                     Discover
             ...                   ...                          ...
             9995         639083591672                VISA 13 digit
             9996     4197551271949528                VISA 13 digit
             9997       36597049683777                VISA 16 digit
             9998     6595168672629675                 JCB 16 digit
             9999  4999092953838318200  Diners Club / Carte Blanche

                  credit_card_security_code                           customer_id  \
             0                          338  a8c966a0-b670-4044-826c-0e6bfe708259
             1                          246  56b850e0-9320-4aa0-8cd4-d1199903c90e
             2                          869  5ec9f613-adb1-4e69-8a1a-9530cb777886
             3                          497  ca182662-b281-433a-a82b-8e061f7bf2cd
             4                          927  1e7c3a60-4788-4711-809f-b6f8bfbdb18a
             ...                        ...                                   ...
             9995                       079  0707f817-5018-4060-b01c-2c5b53374a2e
             9996                       237  abc92c1c-788c-4e61-a40d-c6754c99bdc7
             9997                       287  418cc301-e111-4080-b8f7-8d9f1d9dc304
             9998                       113  7caf0251-8040-4c1e-8190-46133fde16ab
             9999                       810  3b343ad7-9d47-43c6-98d7-8a1c0bfebf12

                                        email                name           phone_number  \
             0            brett00@example.com      Ronald Rodgers                   None
             1      smithjennifer@example.net       Mary Mitchell                   None
             2             twhite@example.net        Nathan Wells    +1-893-568-2182x593
             3     nguyenjennifer@example.com         Kelly Ramos           820-824-2003
             4       michaelabarr@example.net  Rebekah Fitzgerald  +1-269-384-1623x34240
             ...                          ...                 ...                    ...
             9995    andrewrogers@example.net      Tracey Edwards  001-555-466-6738x7224
             9996         sduncan@example.com     Ashley Peterson          (434)761-1066
             9997       rhatfield@example.net   Sandra Baldwin MD     867.829.9891x64114
             9998  andreawilliams@example.org         Karen Green                   None
             9999     anthonykemp@example.net     Marissa Garrett                   None

                          state zip_code
             0         New York    59237
             1          Montana    17401
             2     North Dakota    07166
             3             Iowa    42755
             4      Connecticut    64282
             ...            ...      ...
             9995       Alabama    15476
             9996    New Jersey    58035
             9997   Connecticut    16016
             9998        Nevada    97426
             9999        Nevada    22202

             [10000 rows x 12 columns]

,address,city,credit_card_expires,credit_card_number,credit_card_provider,credit_card_security_code,customer_id,email,name,phone_number,state,zip_code
0,621 Chavez Ramp Suite 938,West Deniseport,06/31,2269172571677458,Diners Club / Carte Blanche,338,a8c966a0-b670-4044-826c-0e6bfe708259,brett00@example.com,Ronald Rodgers,None,New York,59237
1,592 Mccoy River,Port Dannymouth,11/24,676320507830,JCB 16 digit,246,56b850e0-9320-4aa0-8cd4-d1199903c90e,smithjennifer@example.net,Mary Mitchell,None,Montana,17401
2,8923 Aaron Turnpike,Port Rhondaton,11/31,4607779976715144588,JCB 16 digit,869,5ec9f613-adb1-4e69-8a1a-9530cb777886,twhite@example.net,Nathan Wells,+1-893-568-2182x593,North Dakota,07166
3,496 Margaret Shoals,Smithborough,04/33,4234465830748237,Mastercard,497,ca182662-b281-433a-a82b-8e061f7bf2cd,nguyenjennifer@example.com,Kelly Ramos,820-824-2003,Iowa,42755
4,0807 Logan Fords Suite 355,Contrerasside,10/25,4985681645741,Discover,927,1e7c3a60-4788-4711-809f-b6f8bfbdb18a,michaelabarr@example.net,Rebekah Fitzgerald,+1-269-384-1623x34240,Connecticut,64282
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,419 Lopez Crossing,North Nicolechester,01/30,639083591672,VISA 13 digit,079,0707f817-5018-4060-b01c-2c5b53374a2e,andrewrogers@example.net,Tracey Edwards,001-555-466-6738x7224,Alabama,15476
9996,38594 Franklin Pine,Port Joshua,01/31,4197551271949528,VISA 13 digit,237,abc92c1c-788c-4e61-a40d-c6754c99bdc7,sduncan@example.com,Ashley Peterson,(434)761-1066,New Jersey,58035
9997,535 Kimberly Station Apt. 546,Garzaville,07/24,36597049683777,VISA 16 digit,287,418cc301-e111-4080-b8f7-8d9f1d9dc304,rhatfield@example.net,Sandra Baldwin MD,867.829.9891x64114,Connecticut,16016
9998,35316 Becky Terrace,Port Donald,04/24,6595168672629675,JCB 16 digit,113,7caf0251-8040-4c1e-8190-46133fde16ab,andreawilliams@example.org,Karen Green,None,Nevada,97426
9999,6101 Thompson Ridges Apt. 896,Marissamouth,05/25,4999092953838318200,Diners Club / Carte Blanche,810,3b343ad7-9d47-43c6-98d7-8a1c0bfebf12,anthonykemp@example.net,Marissa Garrett,None,Nevada,22202

In [2]:
# using open() and yaml.safe_load to store each entry of the file
with open('customer_demographics.yaml', 'r') as stream:
    data = yaml.safe_load(stream)

# each entry has contains the same order and name for the keys
# creating a pandas df with the key:value pair of each entry as the column:value
demo_df = pd.DataFrame(data.values())


demo_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   address                    9509 non-null   object
 1   city                       9509 non-null   object
 2   credit_card_expires        9547 non-null   object
 3   credit_card_number         9547 non-null   object
 4   credit_card_provider       9547 non-null   object
 5   credit_card_security_code  9547 non-null   object
 6   customer_id                10000 non-null  object
 7   email                      8987 non-null   object
 8   name                       10000 non-null  object
 9   phone_number               7978 non-null   object
 10  state                      9509 non-null   object
 11  zip_code                   9509 non-null   object
dtypes: object(12)
memory usage: 937.6+ KB

In [3]:
# using pandas.read_csv() to load the .csv as a dataframe
customer_df = pd.read_csv("./customer_statistics.csv", encoding = "utf-8")
customer_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   10000 non-null  int64
 1   total_orders  10000 non-null  int64
 2   total_items   10000 non-null  int64
 3   total_spent   10000 non-null  float64
dtypes: float64(1), int64(3)
memory usage: 312.6 KB

In [4]:
# using pandas.read_csv() to load the .csv as a dataframe
orders_df = pd.read_csv("./orders.csv", encoding="utf-8")
orders_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     10000 non-null  object
 1   customer_id  10000 non-null  int64
 2   items        10000 non-null  int64
 3   aperitifs    10000 non-null  object
 4   appetizers   10000 non-null  object
 5   entrees      10000 non-null  object
 6   desserts     10000 non-null  object
 7   total        10000 non-null  float64
dtypes: float64(1), int64(2), object(5)
memory usage: 625.1+ KB

# 2. Finding the Primary and foreign keys of each table

In [6]:
# checking to see if customer_id is the primary key (unique for each entry)
print(demo_df['customer_id'].nunique())
# viewing the table/df
demo_df.head()

10000

,address,city,credit_card_expires,credit_card_number,credit_card_provider,credit_card_security_code,customer_id,email,name,phone_number,state,zip_code
0,621 Chavez Ramp Suite 938,West Deniseport,06/31,2269172571677458,Diners Club / Carte Blanche,338,a8c966a0-b670-4044-826c-0e6bfe708259,brett00@example.com,Ronald Rodgers,None,New York,59237
1,592 Mccoy River,Port Dannymouth,11/24,676320507830,JCB 16 digit,246,56b850e0-9320-4aa0-8cd4-d1199903c90e,smithjennifer@example.net,Mary Mitchell,None,Montana,17401
2,8923 Aaron Turnpike,Port Rhondaton,11/31,4607779976715144588,JCB 16 digit,869,5ec9f613-adb1-4e69-8a1a-9530cb777886,twhite@example.net,Nathan Wells,+1-893-568-2182x593,North Dakota,07166
3,496 Margaret Shoals,Smithborough,04/33,4234465830748237,Mastercard,497,ca182662-b281-433a-a82b-8e061f7bf2cd,nguyenjennifer@example.com,Kelly Ramos,820-824-2003,Iowa,42755
4,0807 Logan Fords Suite 355,Contrerasside,10/25,4985681645741,Discover,927,1e7c3a60-4788-4711-809f-b6f8bfbdb18a,michaelabarr@example.net,Rebekah Fitzgerald,+1-269-384-1623x34240,Connecticut,64282

In [8]:
# checking to see if customer_id is the primary key (unique for each entry)
print(customer_df['customer_id'].nunique())
# viewing the table
customer_df.head()

6283

   customer_id  total_orders  total_items  total_spent
0         8037             5           20       300.39
1         4290             2            3       332.66
2         5367             3            7       643.27
3         4755            10           12       649.12
4         2651            10            9       794.28

In [10]:
# checking to see if order_id is the primary key (unique for each entry)
print(orders_df['order_id'].nunique())
# viewing the table
orders_df.head()

10000

,order_id,customer_id,items,aperitifs,appetizers,entrees,desserts,total
0,f1d6b4c4-0f9f-4ba6-8d5d-f7e4ef7cd9a0,2652,7,Aperol Spritz,Pate,Pork,Tiramisu,751.87
1,7b8a732e-85a0-4fa2-b282-a2d232ee182e,1756,3,Sherry,Pate,Pasta,Cheesecake,156.43
2,1eab436d-2acb-4bc8-b849-fbce859ffd8a,2989,5,Bellini,Pate,Lobster,Chocolate Cake,364.13
3,d6313392-8901-42f6-bf8a-4805fe816a46,9903,3,Sherry,Salad,Pizza,Cheesecake,805.62
4,f73f8c45-28c2-473f-a3ba-e65ed5890ac6,8627,2,Port,Pate,Lobster,Pie,638.43

In [16]:
# Merging the orders.csv df with the customer_statistics.csv df
# on customer_id
customer_order_df = customer_df.merge(orders_df,on="customer_id",how="inner")
customer_order_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10006 entries, 0 to 10005
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   10006 non-null  int64
 1   total_orders  10006 non-null  int64
 2   total_items   10006 non-null  int64
 3   total_spent   10006 non-null  float64
 4   order_id      10006 non-null  object
 5   items         10006 non-null  int64
 6   aperitifs     10006 non-null  object
 7   appetizers    10006 non-null  object
 8   entrees       10006 non-null  object
 9   desserts      10006 non-null  object
 10  total         10006 non-null  float64
dtypes: float64(2), int64(4), object(5)
memory usage: 860.0+ KB

In [17]:
# The Duplicate entries of customer_id from customer_statistics is causing extra rows
# Aggregating customer_stats.csv df so that the customer_id has no duplicates

unique_customer = customer_df.groupby('customer_id').sum().reset_index()


# merging the aggregated customer_stats df with the orders df
unique_customer_order_df = orders_df.merge(unique_customers,on="customer_id")
unique_customer_order_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6302 entries, 0 to 6301
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      6302 non-null   object
 1   customer_id   6302 non-null   int64
 2   items         6302 non-null   int64
 3   aperitifs     6302 non-null   object
 4   appetizers    6302 non-null   object
 5   entrees       6302 non-null   object
 6   desserts      6302 non-null   object
 7   total         6302 non-null   float64
 8   total_orders  6302 non-null   int64
 9   total_items   6302 non-null   int64
 10  total_spent   6302 non-null   float64
dtypes: float64(2), int64(4), object(5)
memory usage: 541.7+ KB

In [18]:
# merging the demographics onto our demographics df with
# our merged df with order_id
demo_df.rename(columns={'customer_id':'order_id'},inplace=True)
customer_order_demo = unique_customer_order_df.merge(demo_df,on='order_id')
customer_order_demo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 0 entries
Data columns (total 22 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   order_id                   0 non-null      object
 1   customer_id                0 non-null      int64
 2   items                      0 non-null      int64
 3   aperitifs                  0 non-null      object
 4   appetizers                 0 non-null      object
 5   entrees                    0 non-null      object
 6   desserts                   0 non-null      object
 7   total                      0 non-null      float64
 8   total_orders               0 non-null      int64
 9   total_items                0 non-null      int64
 10  total_spent                0 non-null      float64
 11  address                    0 non-null      object
 12  city                       0 non-null      object
 13  credit_card_expires        0 non-null      object
 14  credit_card_number         0 non-null      object
 15  credit_card_provider       0 non-null      object
 16  credit_card_security_code  0 non-null      object
 17  email                      0 non-null      object
 18  name                       0 non-null      object
 19  phone_number               0 non-null      object
 20  state                      0 non-null      object
 21  zip_code                   0 non-null      object
dtypes: float64(2), int64(4), object(16)
memory usage: 132.0+ bytes

In [19]:
# there are now matching keys for our demographics and merged table
# changing the demographics primary key to the index and considering
# that the customer_id since the customer_id is an int from 0-9999
demo_df.rename(columns={'order_id':'customer_second_id'},inplace=True)
demo_df['customer_id'] =demo_df.index
customer_order_demo_df2 = unique_customer_order_df.merge(demo_df,on='customer_id')
customer_order_demo_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6302 entries, 0 to 6301
Data columns (total 23 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   order_id                   6302 non-null   object
 1   customer_id                6302 non-null   int64
 2   items                      6302 non-null   int64
 3   aperitifs                  6302 non-null   object
 4   appetizers                 6302 non-null   object
 5   entrees                    6302 non-null   object
 6   desserts                   6302 non-null   object
 7   total                      6302 non-null   float64
 8   total_orders               6302 non-null   int64
 9   total_items                6302 non-null   int64
 10  total_spent                6302 non-null   float64
 11  address                    5998 non-null   object
 12  city                       5998 non-null   object
 13  credit_card_expires        6019 non-null   object
 14  credit_card_number         6019 non-null   object
 15  credit_card_provider       6019 non-null   object
 16  credit_card_security_code  6019 non-null   object
 17  customer_second_id         6302 non-null   object
 18  email                      5634 non-null   object
 19  name                       6302 non-null   object
 20  phone_number               5035 non-null   object
 21  state                      5998 non-null   object
 22  zip_code                   5998 non-null   object
dtypes: float64(2), int64(4), object(17)
memory usage: 1.1+ MB